docs/rfcs/005-rdf-definitions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-19 Fri 08:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RFC005: Explicit RDF definitions</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../plain-sdml.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">RFC005: Explicit RDF definitions
<br />
<span class="subtitle">Status: Approved</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4912371">1. Introduction</a></li>
<li><a href="#orgad36dec">2. Motivation</a></li>
<li><a href="#org2caf73a">3. Alternatives Considered</a></li>
<li><a href="#org70541d8">4. Proposed Change</a>
<ul>
<li><a href="#org018f33d">4.1. Test cases</a></li>
<li><a href="#org51cff61">4.2. Impact</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org4912371" class="outline-2">
<h2 id="org4912371"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
It turns out to be confusing to use existing structure types to define new RDF classes and properties. Rather than
continuing to document rules on composition and restrictions on some RDF predicates we regularize these into new
explicit definitions.
</p>
</div>
</div>

<div id="outline-container-orgad36dec" class="outline-2">
<h2 id="orgad36dec"><span class="section-number-2">2.</span> Motivation</h2>
<div class="outline-text-2" id="text-2">
<p>
The current use of standard structures to define RDF classes and properties is cumbersome.
</p>
</div>
</div>

<div id="outline-container-org2caf73a" class="outline-2">
<h2 id="org2caf73a"><span class="section-number-2">3.</span> Alternatives Considered</h2>
<div class="outline-text-2" id="text-3">
<p>
None.
</p>
</div>
</div>

<div id="outline-container-org70541d8" class="outline-2">
<h2 id="org70541d8"><span class="section-number-2">4.</span> Proposed Change</h2>
<div class="outline-text-2" id="text-4">
<p>
<b><i>Syntax</i></b>: The following grammar changes are required:
</p>

<ol class="org-ol">
<li>Add a new <code>rdf_def</code> rule to the grammar that defines either a class or property using an <code>annotaion_only_body</code> (listing <a href="#org8b0240d">1</a>).</li>
<li>Add specific rules <code>rdf_type_class</code> and <code>rdf_type_property</code> for the distinct keywords (listing <a href="#org8b0240d">1</a>).</li>
<li>Add a new <code>rdf_super_types</code> to specify the type or types of the definition.</li>
<li>Add the new rule <code>rdf_def</code> to the existing <code>definition</code> rule (listing <a href="#org210ca83">2</a>).</li>
</ol>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Grammar for <code>rdf_def</code> rule</label><pre class="src src-js" id="org8b0240d">rdf_def: $ =&gt; seq<span style="color: #657b83;">(</span>
    keyword<span style="color: #2aa198;">(</span><span style="color: #2aa198;">'rdf'</span><span style="color: #2aa198;">)</span>,
    field<span style="color: #2aa198;">(</span>
        <span style="color: #2aa198;">'type'</span>,
        choice<span style="color: #b58900;">(</span>
            $.rdf_type_class,
            $.rdf_type_property,
        <span style="color: #b58900;">)</span>
    <span style="color: #2aa198;">)</span>,
    field<span style="color: #2aa198;">(</span><span style="color: #2aa198;">'name'</span>, $.identifier<span style="color: #2aa198;">)</span>,
    optional<span style="color: #2aa198;">(</span>field<span style="color: #b58900;">(</span><span style="color: #2aa198;">'super_types'</span>, $.rdf_super_types<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>,
    field<span style="color: #2aa198;">(</span><span style="color: #2aa198;">'body'</span>, $.annotation_only_body<span style="color: #2aa198;">)</span>
<span style="color: #657b83;">)</span>,

rdf_type_class: $ =&gt; keyword<span style="color: #657b83;">(</span><span style="color: #2aa198;">'structure'</span><span style="color: #657b83;">)</span>,
rdf_type_property: $ =&gt; keyword<span style="color: #657b83;">(</span><span style="color: #2aa198;">'property'</span><span style="color: #657b83;">)</span>,

rdf_super_types: $ =&gt; seq<span style="color: #657b83;">(</span>
    operator<span style="color: #2aa198;">(</span><span style="color: #2aa198;">'&lt;-'</span><span style="color: #2aa198;">)</span>,
    choice<span style="color: #2aa198;">(</span>
        $.identifier_reference,
        seq<span style="color: #b58900;">(</span>
            <span style="color: #2aa198;">'['</span>,
            repeat<span style="color: #859900;">(</span>$.identifier_reference<span style="color: #859900;">)</span>,
            <span style="color: #2aa198;">']'</span>
        <span style="color: #b58900;">)</span>
    <span style="color: #2aa198;">)</span>
<span style="color: #657b83;">)</span>,
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Grammar for <code>definition</code> rule</label><pre class="src src-js" id="org210ca83">definition: $ =&gt; choice<span style="color: #657b83;">(</span>
    $.data_type_def,
    $.entity_def,
    $.enum_def,
    $.event_def,
    $.property_def,
    $.structure_def,
    $.type_class_def,
    $.union_def,
    $.rdf_def
<span style="color: #657b83;">)</span>,
</pre>
</div>

<p>
<b><i>Semantics</i></b>: As the super type list is optional the semantics assume the following:
</p>

<ol class="org-ol">
<li>If the keyword <code>structure</code> is used and <b>no</b> super types are provided, a predicate <code>rdfs:type</code> with object <code>rdfs:Class</code> is added.</li>
<li>If the keyword <code>structure</code> is used and super types <b>are</b> provided, a predicate <code>rdfs:subClassOf</code> is added for each super
type with the super type as object.</li>
<li>If the keyword <code>structure</code> is used and an <b>empty</b> super type list is provided, no <code>rdfs:type</code> or <code>rdfs:subClassOf</code> are added.</li>
<li>If the keyword <code>property</code> is used and no super types are provided a predicate <code>rdfs:type</code> with object <code>rdf:Property</code> is added.</li>
<li>If the keyword <code>property</code> is used and super types <b>are</b> provided, a predicate <code>rdfs:subPropertyOf</code> is added for each super
type with the super type as object.</li>
<li>If the keyword <code>property</code> is used and an <b>empty</b> super type list is provided, no <code>rdfs:type</code> or <code>rdfs:subPropertyOf</code> are added.</li>
</ol>

<p>
<b><i>Example</i></b>: Listing <a href="#org3a0aa7b">3</a> shows this new grammar used to define elements in the RDF Schema module.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Example Module</label><pre class="src src-sdml" id="org3a0aa7b"><span style="color: #859900;">module</span> <span style="color: #268bd2;">rdf_schema</span> <span style="color: #2aa198; font-weight: bold;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">&lt;http://www.w3.org/2000/01/rdf-schema#&gt;</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -"> </a><span style="color: #859900;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">is</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">

  </a><span style="color: #859900;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">import</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -"> </a><span style="color: #657b83; background-color: #fdf6e3;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">[</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -"> </a><span style="color: #268bd2;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">owl</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -"> </a><span style="color: #268bd2;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">rdf</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -"> </a><span style="color: #657b83; background-color: #fdf6e3;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">]</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">

  </a><span style="color: #859900;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">structure</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -"> </a><span style="color: #268bd2;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">Foo</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -"> </a><span style="color: #859900;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">is</a></span><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -"> a </a><span style="color: #859900;"><a href="http://www.w3.org/2000/01/rdf-schema#&gt; is

  import [ owl rdf ]

  structure Foo is a -">-&gt;</a></span> <span style="color: #6c71c4;">string</span> <span style="color: #859900;">end</span>

  <span style="color: #859900;">rdf</span> <span style="color: #859900;">structure</span> <span style="color: #268bd2;">Resource</span> &lt;- Resource <span style="color: #859900;">is</span> <span style="color: #93a1a1; font-style: italic;">;; assumed: @rdf:type = rdf:Class</span>
    <span style="color: #d33682;">@comment</span> <span style="color: #859900;">=</span> <span style="color: #2aa198;">"The class resource, everything."</span>
  <span style="color: #859900;">end</span>

  <span style="color: #859900;">rdf</span> <span style="color: #859900;">property</span> <span style="color: #268bd2;">subClassOf</span> <span style="color: #859900;">is</span> <span style="color: #93a1a1; font-style: italic;">;; assumed: @rdf:type = rdf:Property</span>
    <span style="color: #d33682;">@domain</span> <span style="color: #859900;">=</span> <span style="color: #268bd2;">Class</span>
    <span style="color: #d33682;">@range</span> <span style="color: #859900;">=</span> <span style="color: #268bd2;">Class</span>
    <span style="color: #d33682;">@comment</span> <span style="color: #859900;">=</span> <span style="color: #2aa198;">"The subject is a subclass of a class."</span>
  <span style="color: #859900;">end</span>

  <span style="color: #859900;">rdf</span> <span style="color: #859900;">property</span> <span style="color: #268bd2;">comment</span> <span style="color: #859900;">is</span>
    <span style="color: #d33682;">@rdf:type</span> <span style="color: #859900;">=</span> <span style="color: #268bd2;">owl:AnnotationProperty</span>
    <span style="color: #d33682;">@domain</span> <span style="color: #859900;">=</span> <span style="color: #268bd2;">Resource</span>
    <span style="color: #d33682;">@range</span> <span style="color: #859900;">=</span> <span style="color: #268bd2;">Literal</span>
    <span style="color: #d33682;">@comment</span> <span style="color: #859900;">=</span> <span style="color: #2aa198;">"A description of the subject resource."</span>
  <span style="color: #859900;">end</span>

<span style="color: #859900;">end</span>
</pre>
</div>
</div>

<div id="outline-container-org018f33d" class="outline-3">
<h3 id="org018f33d"><span class="section-number-3">4.1.</span> Test cases</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>The module in listing <a href="#org3a0aa7b">3</a> is included in the tree-sitter-sdml package in the <code>examples</code> directory
which is included in the parser test step.</li>
<li>An explicit test case, <code>rdf_definitions.sdm</code> has been added to the tree-sitter-sdml <code>test/corpus</code> directory.</li>
<li>An explicit test case, <code>rdf_definitions.sdm</code> has been added to the sdml-parse crate&rsquo;s <code>tests/examples</code> directory.</li>
</ol>
</div>
</div>

<div id="outline-container-org51cff61" class="outline-3">
<h3 id="org51cff61"><span class="section-number-3">4.2.</span> Impact</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This will require changes to the reference documentation to:
</p>

<ul class="org-ul">
<li>add new rules to <code>sdml.ebnf</code>,</li>
<li>update the surface syntax description to include these new rules, and</li>
<li>rewrite the section on defining new RDF properties and classes.</li>
</ul>

<p>
This will change how we define standard library modules as well.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-01-19 Fri 08:00</p>
</div>
</body>
</html>
